<!DOCTYPE html>
<html lang="pt-br">
    <head>
        <meta charset="utf-8">
        <meta name="viewport" content="width=device-width, initial-scale=1">
        <meta name="description" content="">
        <meta name="author" content="">

        <title>Ajuda</title>
        <link href="img/favicon.ico" rel="icon" type="image/x-icon" />
        <link href="css/bootstrap.css" rel="stylesheet">
        <link href="css/style.css" rel="stylesheet">


        <script type="text/javascript" src="js/jquery.min.js"></script>
        <script type="text/javascript" src="js/leftBar.js"></script>
        <script type="text/javascript" src="js/interface.js"></script>
        <script type="text/javascript" src="js/bootstrap.min.js"></script>
        <script type="text/javascript" src="js/ASCIIMathML.js"></script>
        <script type="text/javascript" src="js/MathJax/MathJax.js?config=AM_HTMLorMML"></script>
    </head>
    <body>
        <!-- Navbar -->
        <div class="navbar navbar-default navbar-fixed-top" role="navigation">
            <div class="container">
                <div class="navbar-header">
                    <a class="navbar-brand" href="index.html">Pesquisa Operacional</a>
                </div>
                <div class="navbar-collapse collapse navbar-right">
                    <ul class="nav navbar-nav">
                        <li><a href="index.html">INÍCIO</a></li>
                        <li class="active"><a href="modelo_branchbound.html" id="modelo">DESCRI&Ccedil;&Amacr;O</a></li>
                        <li><a href="ajuda_branchbound.html">AJUDA</a></li>
                    </ul>
                </div>
            </div>
        </div>
        <div id="content">
            <div id="masthead">
                <div class="container">
                    <div class="row">
                        <div class="col-md-7">
                            <h1>
                                Pesquisa Operacional
                                <p class="lead">Programação Linear (PL)</p>
                            </h1>
                        </div>
                    </div>
                </div><!--/container-->
            </div><!--/masthead-->
            <!--main-->
            <div class="container">
                <div class="row">
                    <!--left-->
                    <div class="col-md-3" id="leftCol">
                        <ul class="nav nav-stacked" id="sidebar">
                            <li><a href="#sec0">Introdução</a></li>
                            <li><a href="#sec1">Utilizando Método Simplex</a></li>
                            <li><a href="#sec2">Utilizando Branch-Bound</a></li>
                        </ul>
                    </div><!--/left-->
                    <!--right-->
                    <div class="col-md-9" id="pagModelo">
                        <h2 id="sec0">Introdução </h2>
                        <hr>
                        <p>
                            A Programação Linear (PL) tem sido uma importante ferramenta de análise para grandes empresas pelo mundo.
                            Em um breve resumo, ela se propôe a otimizar recursos limitados para atividades que competem entre si.
                        </p>
                        <p>
                            A Programação Linear utiliza de um modelo matemático para descrever o problema proposto. Através desse modelo proposto, é feita uma análise
                            gráfica, mostrando qual será a região de soluções viáveis. Segue-se abaixo um exemplo da região com as retas de restriçoes de um problema: 
                        </p>
                        <div class="row" >
                            <div class="col-md-6 col-sm-6 col-md-offset-3">
                                <div class="panel panel-primary secondary ">
                                    <div class="panel-heading"><h4> Exemplo:</h4></div>
                                    <div class="panel-body">
                                        <img src="img/img_solviavel.png" class="img-responsive">
                                    </div>
                                </div>
                            </div>

                        </div>
                        <p> A determinação da solução ótima requer identificar a direção na qual a função objetivo z aumenta (maximização) ou diminue (minimização).
                        O ponto dentro da região viável onde z é maior (maximização) ou menor (minimização) será a solução ótima.</p>
                        <p>Segue-se abaixo um exemplo:</p>
                        <div class="row">
                            <div class="col-md-6 col-sm-6">
                                <div class="panel panel-primary secondary ">
                                    <div class="panel-heading"><h4> Exemplo:</h4></div>
                                    <div class="panel-body">
                                        <img src="img/img_solviavel2.png" class="img-responsive">
                                    </div>
                                </div>
                            </div>
                            <div class="col-md-6 col-sm-6">
                                <blockquote>
                                    <p> Solução: </p>
                                    <center>
                                        A solução ótima se encontra no ponto C.
                                    </center>
                                </blockquote>
                            </div>
                        </div>
                            <br>
                            <h2 id="sec1">Resolvendo PL Usando método Simplex </h2>
                            <h2 id="sec2">Resolvendo PLIM Usando Branch-Bound</h2><hr>
                            <p>
                                A programação Linear Inteira Mista tem uma grande vantagem em relação a Programação Inteira que é permitir que sejam incluídos
                                na análise os custos fixos, bem como diferentes níveis de custos variáveis para as instalações.
                                Estes problemas possuem soluções mais complexa em relação aqueles que utilizam a Programação Linear. Contudo na Programação Linear,
                                existem condições necessárias e suficientes de otimização teoricamente provadas que podem ser
                                utilizadas para testar eficientemente se uma dada solução viável é uma solução ótima ou não.
                            </p>
                            <p>
                                A Programação Linear está preocupada com a maximização ou minimização de uma
                                equação sobre certos critérios ou restrições. Abaixo temos um exemplo:
                            </p>

                            <div class="row">
                                <div class="col-md-6 col-sm-6">
                                    <div class="panel panel-primary secondary ">
                                        <div class="panel-heading"><h4> Exemplo:</h4></div>
                                        <div class="panel-body">
                                            <img src="img/exemplo1.png" class="img-responsive">
                                        </div>
                                    </div>
                                </div>
                                <div class="col-md-6 col-sm-6">
                                    <blockquote>
                                        <p> Este problema pode ser resolvido pelo Método Simplex ou Simplex duas Fases. A solução ótima se encontra abaixo: </p>
                                        <center>
                                            ` x = (x_1,x_2,x_3) = (0.5,0,1.5)`
                                        </center>
                                    </blockquote>
                                </div>

                            </div>
                            <p>
                                Problemas como estes são utilizados em todas as empresas para minimizar o desperdício, maximizar lucro, ou otimizar a outros aspectos do negócio .
                                No entanto, algumas partes da solução pode ser limitada a números inteiros,

                                `x in  Z^+`
                            </p>
                            <p>
                                Programação linear inteira mista é uma PL(Programação Linear) que existe alguma ou todas as variáveis não inteiras. Portanto precisamos de encontrar uma
                                nova solução ótima para evitarmos casos de números parciais. Simplesmente com o arredondamento, a solução muitas vezes pode sair da região viável, comprometendo a otimalidade.
                            </p>
                            <p>
                                O problema com a resolu&ccedil;&atilde;o de PLIMs usando o m&eacute;todo Simplex &eacute; que ele
                                frequentemente retorna partes de
                                ` x = (x_1,x_2,x_3)` que n&atilde;o est&atilde;o em forma de n&uacute;mero inteiro.
                            </p>
                            <p>
                                Para resolver usando o Branch and Bound, primeiro resolvemos o problema usando o Relaxamento, o que significa resolv&ecirc;-lo pelo Simplex Revisado como se n&atilde;o houvesse
                                restri&ccedil;&odblac;es inteiras. Assim, obtemos: ` z = cx`.
                            </p>
                            <p>
                                Como o exemplo usado envolve um problema de maximiza&ccedil;&atilde;o que engloba todas as solu&ccedil;&odblac;es inteiras, ent&atilde;o esse &eacute; um limite superior da PLIM. Em seguida, escolhe-se uma vari&aacute;vel n&atilde;o inteira.
                                Comumente, escolhe-se a vari&aacute;vel mais fracionada, que esteja mais pr&oacute;xima do valor mediano ou mais distante de um n&uacute;mero inteiro.
                            </p>
                            <p>
                                Por exemplo, em ` x = (1.25, 3.45, 2.75, 5)`, escolhe-se ramificar em `x_2`, pois `0.45` est&aacute; mais pr&oacute;ximo de `0.5` do que as outras fra&ccedil;&odblac;es. A partir disso, criamos
                                dois subproblemas ou dois nodos de nossa &aacute;rvore. Em um n&oacute; adicionamos a restri&ccedil;&atilde;o `x_2<=3`, na outra adicionamos `x_2>=4`. Seja `S` o conjunto solu&ccedil;&atilde;o vi&aacute;vel do relaxamento: `S = {x: Ax<=b\ e\ x>=0}`, temos que:
                            </p>
                            <div class="row">
                                <div class="col-md-4 col-sm-4 col-md-offset-4">
                                    <blockquote>
                                        <center>
                                            ` S_1 = S \cap{x:x_j <= \lfloor\hat{x}_j\rfloor\} `
                                            ` S_1 = S \cap{x:x_j >= \ceil{hat{x}_j}} `
                                        </center>
                                    </blockquote>
                                </div>
                            </div>
                            <p>
                                Ent&atilde;o, cada um dos n&oacute;s devem ser resolvidos com suas novas restri&ccedil;&odblac;es pelo m&eacute;todo Dual Simplex. Caso o problema seja invi&aacute;vel, ent&atilde;o o n&oacute; &eacute; cortado por inviabilidade. A solu&ccedil;&atilde;o &oacute;tima &eacute; encontrada quando todos os n&oacute;s fracion&aacute;rios s&atilde;o cortados.
                            </p>


                        </div><!--/right-->
                </div><!--/row-->
            </div><!--/container-->
            <div class="scroll-top-wrapper ">
                <span class="scroll-top-inner">
                    <i class="glyphicon glyphicon-arrow-up"></i>
                </span>
            </div>
        </div>
    </body>

    <script type="text/javascript" src="js/leftBar.js"></script>
    <script type="text/javascript" src="js/ASCIIMathML.js"></script>
    <script type="text/javascript" src="js/MathJax/MathJax.js?config=AM_HTMLorMML"></script>

